package com.symphony.digital_library.data.use_case;

/**
 * Інтерфейс {@code UseCase} представляє загальний контракт для виконання будь-якого конкретного сценарію використання.
 * <p>
 * Він визначає єдиний метод {@link #invoke()}, який реалізується для виконання певної логіки та повернення результату.
 * </p>
 *
 * @param <T> Тип результату, який повертається після виконання сценарію використання.
 */
public interface UseCase<T> {

    /**
     * Виконує сценарій використання та повертає результат.
     *
     * @return Результат виконання у вигляді об'єкта типу {@code T}.
     */
    T invoke();
}