package com.symphony.digital_library.data.use_case;

/**
 * Інтерфейс {@code UseCaseParams} представляє загальний контракт для виконання сценарію використання
 * з вхідними параметрами та результатом.
 * <p>
 * Він визначає метод {@link #invoke(Object)}, який приймає параметр певного типу та повертає результат.
 * </p>
 *
 * @param <T> Тип вхідного параметра, який необхідний для виконання сценарію використання.
 * @param <R> Тип результату, який повертається після виконання сценарію використання.
 */
public interface UseCaseParams<T, R> {

    /**
     * Виконує сценарій використання з переданим параметром.
     *
     * @param item Вхідний параметр, використаний для виконання логіки.
     * @return Результат виконання у вигляді об'єкта типу {@code R}.
     */
    R invoke(T item);
}